danielinux/m33mu/cpu/imxrt700/imxrt700_secure.c
/* m33mu -- an ARMv8-M Emulator
 *
 * Copyright (C) 2025  Daniele Lacamera <root@danielinux.net>
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU Affero General Public License as published
 * by the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU Affero General Public License
 * along with this program.  If not, see <https://www.gnu.org/licenses/>.
 *
 * SPDX-License-Identifier: AGPL-3.0-or-later
 *
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "imxrt700/imxrt700_secure.h"
#include "imxrt700/imxrt700_mmio.h"
#include "imxrt700/cpu_config.h"
#include "m33mu/memmap.h"
#include "m33mu/mmio.h"
#include "m33mu/host_rng.h"

#ifdef M33MU_HAS_WOLFSSL
#include <wolfssl/options.h>
#include <wolfssl/wolfcrypt/settings.h>
#include <wolfssl/wolfcrypt/aes.h>
#include <wolfssl/wolfcrypt/sha256.h>
#include <wolfssl/wolfcrypt/hmac.h>
#include <wolfssl/wolfcrypt/integer.h>
#endif

static mm_u32 rd32le(const mm_u8 *p)
{
    return (mm_u32)p[0] | ((mm_u32)p[1] << 8) | ((mm_u32)p[2] << 16) | ((mm_u32)p[3] << 24);
}

static void wr32le(mm_u8 *p, mm_u32 v)
{
    p[0] = (mm_u8)v;
    p[1] = (mm_u8)(v >> 8);
    p[2] = (mm_u8)(v >> 16);
    p[3] = (mm_u8)(v >> 24);
}

/* ------------------------------------------------------------------------ */
/* GLIKEY                                                                   */
/* ------------------------------------------------------------------------ */

#define GLIKEY_CTRL_0 0x0u
#define GLIKEY_CTRL_1 0x4u
#define GLIKEY_INTR_CTRL 0x8u
#define GLIKEY_STATUS 0xCu

#define CTRL0_WRITE_INDEX_MASK 0xFFu
#define CTRL0_WR_EN_0_SHIFT 16u
#define CTRL0_SFT_RST (1u << 18)
#define CTRL1_READ_INDEX_MASK 0xFFu
#define CTRL1_WR_EN_1_SHIFT 16u
#define CTRL1_SFR_LOCK_SHIFT 18u
#define SFR_UNLOCKED 0xAu

#define FSM_WR_DIS 0x0Bu
#define FSM_INIT 0x16u
#define FSM_STEP1 0x2Cu
#define FSM_STEP2 0x58u
#define FSM_STEP3 0xB0u
#define FSM_STEP4 0x160u
#define FSM_LOCKED 0xC01u
#define FSM_WR_EN 0x1802u

#define GLIKEY_COUNT 6u

struct glikey_state {
    struct imxrt700_dev *dev;
    mm_u32 fsm;
    mm_u32 write_index;
    mm_bool error;
    mm_u8 index_locked[32]; /* 256 write indexes */
};

static struct glikey_state glikeys[GLIKEY_COUNT];

static mm_bool glikey_index_locked(const struct glikey_state *g, mm_u32 idx)
{
    return (g->index_locked[(idx >> 3) & 31u] & (1u << (idx & 7u))) != 0u ? MM_TRUE : MM_FALSE;
}

static void glikey_reset_one(struct glikey_state *g)
{
    g->fsm = FSM_INIT;
    g->write_index = 0u;
    g->error = MM_FALSE;
}

/* The FSM advances on the (WR_EN_0, WR_EN_1) pair the SDK codewords
 * produce: (1,0) STEP1, (1,1) STEP2, (2,1) STEP3, (2,0) STEP4, (0,0) WR_EN.
 * (2,0) from WR_EN ends the operation, (3,x) from WR_EN locks the index. */
static void glikey_step(struct glikey_state *g, mm_u32 wr0, mm_u32 wr1, mm_u32 prev0, mm_u32 prev1)
{
    if (wr0 == prev0 && wr1 == prev1) {
        return;
    }
    if (g->fsm == FSM_WR_DIS) {
        return;
    }
    if (wr0 == 1u && wr1 == 0u) {
        mm_u32 idx = mm_imxrt700_reg(g->dev, GLIKEY_CTRL_0) & CTRL0_WRITE_INDEX_MASK;
        if (glikey_index_locked(g, idx)) {
            g->fsm = FSM_WR_DIS;
            g->error = MM_TRUE;
            return;
        }
        g->write_index = idx;
        g->fsm = FSM_STEP1;
        return;
    }
    switch (g->fsm) {
    case FSM_STEP1:
        if (wr0 == 1u && wr1 == 1u) { g->fsm = FSM_STEP2; return; }
        break;
    case FSM_STEP2:
        if (wr0 == 2u && wr1 == 1u) { g->fsm = FSM_STEP3; return; }
        break;
    case FSM_STEP3:
        if (wr0 == 2u && wr1 == 0u) { g->fsm = FSM_STEP4; return; }
        break;
    case FSM_STEP4:
        if (wr0 == 0u && wr1 == 0u) { g->fsm = FSM_WR_EN; return; }
        break;
    case FSM_WR_EN:
        if (wr0 == 3u) {
            g->index_locked[(g->write_index >> 3) & 31u] |= (mm_u8)(1u << (g->write_index & 7u));
            g->fsm = FSM_LOCKED;
            return;
        }
        if (wr0 == 2u) { g->fsm = FSM_INIT; return; }
        break;
    case FSM_LOCKED:
    case FSM_INIT:
        if (wr0 == 2u) { g->fsm = FSM_INIT; return; }
        break;
    default:
        break;
    }
    g->fsm = FSM_WR_DIS;
    g->error = MM_TRUE;
}

static mm_bool glikey_read(struct imxrt700_dev *dev, mm_u32 off, mm_u32 size, mm_u32 *value_out)
{
    struct glikey_state *g = (struct glikey_state *)dev->opaque;
    if (off == GLIKEY_STATUS && size == 4u) {
        mm_u32 ridx = mm_imxrt700_reg(dev, GLIKEY_CTRL_1) & CTRL1_READ_INDEX_MASK;
        mm_u32 v = (g->fsm << 19) | (g->error ? (1u << 2) : 0u);
        if (glikey_index_locked(g, ridx)) {
            v |= 1u << 1;
        }
        v |= mm_imxrt700_reg(dev, GLIKEY_STATUS) & 1u;
        *value_out = v;
        return MM_TRUE;
    }
    return MM_FALSE;
}

static mm_bool glikey_write(struct imxrt700_dev *dev, mm_u32 off, mm_u32 size, mm_u32 value)
{
    struct glikey_state *g = (struct glikey_state *)dev->opaque;
    mm_u32 c0 = mm_imxrt700_reg(dev, GLIKEY_CTRL_0);
    mm_u32 c1 = mm_imxrt700_reg(dev, GLIKEY_CTRL_1);
    mm_u32 prev0 = (c0 >> CTRL0_WR_EN_0_SHIFT) & 3u;
    mm_u32 prev1 = (c1 >> CTRL1_WR_EN_1_SHIFT) & 3u;
    mm_bool sfr_locked = ((c1 >> CTRL1_SFR_LOCK_SHIFT) & 0xFu) != SFR_UNLOCKED ? MM_TRUE : MM_FALSE;

    if (size != 4u) {
        return MM_FALSE;
    }
    switch (off) {
    case GLIKEY_CTRL_0:
        if (sfr_locked) {
            return MM_TRUE;
        }
        if (value & CTRL0_SFT_RST) {
            glikey_reset_one(g);
            mm_imxrt700_reg_put(dev, GLIKEY_CTRL_0, 2u << CTRL0_WR_EN_0_SHIFT);
            mm_imxrt700_reg_put(dev, GLIKEY_CTRL_1, c1 & ~(3u << CTRL1_WR_EN_1_SHIFT));
            return MM_TRUE;
        }
        value &= CTRL0_WRITE_INDEX_MASK | (3u << CTRL0_WR_EN_0_SHIFT);
        mm_imxrt700_reg_put(dev, GLIKEY_CTRL_0, value);
        glikey_step(g, (value >> CTRL0_WR_EN_0_SHIFT) & 3u, prev1, prev0, prev1);
        return MM_TRUE;
    case GLIKEY_CTRL_1:
        if (sfr_locked) {
            return MM_TRUE;
        }
        value &= CTRL1_READ_INDEX_MASK | (3u << CTRL1_WR_EN_1_SHIFT) | (0xFu << CTRL1_SFR_LOCK_SHIFT);
        mm_imxrt700_reg_put(dev, GLIKEY_CTRL_1, value);
        glikey_step(g, prev0, (value >> CTRL1_WR_EN_1_SHIFT) & 3u, prev0, prev1);
        return MM_TRUE;
    case GLIKEY_INTR_CTRL: {
        mm_u32 st = mm_imxrt700_reg(dev, GLIKEY_STATUS);
        if (value & 2u) st &= ~1u;
        if (value & 4u) st |= 1u;
        mm_imxrt700_reg_put(dev, GLIKEY_STATUS, st);
        mm_imxrt700_reg_put(dev, GLIKEY_INTR_CTRL, value & 1u);
        return MM_TRUE;
    }
    case GLIKEY_STATUS:
        return MM_TRUE;
    default:
        return MM_FALSE;
    }
}

mm_bool mm_imxrt700_glikey_write_enabled(mm_u32 glikey, mm_u32 index)
{
    if (glikey >= GLIKEY_COUNT) {
        return MM_FALSE;
    }
    return (glikeys[glikey].fsm == FSM_WR_EN && glikeys[glikey].write_index == index) ? MM_TRUE : MM_FALSE;
}

/* ------------------------------------------------------------------------ */
/* AHB secure controllers                                                   */
/* ------------------------------------------------------------------------ */

#define AHBSC_MISC_CTRL_DP 0xFF8u
#define AHBSC_MISC_CTRL 0xFFCu
#define AHBSC_RULES_END 0x580u /* memory and peripheral rule registers */
#define MISC_FIELD(v, shift) (((v) >> (shift)) & 3u)
#define MISC_WRITE_LOCK 0u
#define MISC_ENABLE_SECURE_CHECKING 2u
#define MISC_IDAU_ALL_NS 14u
#define FIELD_ENABLED 1u

