danielinux/m33mu/cpu/imxrt700/imxrt700_secure.c
/* GLIKEY0 index 1 unlocks the AHBSC0 MISC_CTRL registers (SDK BOARD_InitAHBSC). */
#define GLIKEY0_IDX_AHBSC0_MISC 1u

static struct imxrt700_dev *ahbsc0;
static mm_u32 active_core;

static mm_bool ahbsc_write(struct imxrt700_dev *dev, mm_u32 off, mm_u32 size, mm_u32 value)
{
    mm_u32 misc = mm_imxrt700_reg(dev, AHBSC_MISC_CTRL);
    mm_bool locked = MISC_FIELD(misc, MISC_WRITE_LOCK) == FIELD_ENABLED ? MM_TRUE : MM_FALSE;
    (void)size;
    (void)value;
    if (off == AHBSC_MISC_CTRL || off == AHBSC_MISC_CTRL_DP) {
        if (locked) {
            return MM_TRUE;
        }
        if (dev == ahbsc0 && !mm_imxrt700_glikey_write_enabled(0u, GLIKEY0_IDX_AHBSC0_MISC)) {
            return MM_TRUE;
        }
        return MM_FALSE;
    }
    if (off < AHBSC_RULES_END && locked) {
        return MM_TRUE;
    }
    return MM_FALSE;
}

/* SRAM partitions P0..P29 (KB) and their AHBSC0 SRAM_n_RULE offsets.  Each
 * partition has 4 rule registers x 8 rules = 32 equal sub-regions. */
static const mm_u16 sram_part_kb[30] = {
    32, 32, 32, 32, 64, 64, 128, 128, 256, 256, 512, 512, 1024, 1024, 512, 512, 256, 256,
    32, 32, 32, 32, 64, 64, 128, 128, 512, 512, 256, 256
};
static const mm_u16 sram_rule_off[30] = {
    0x110, 0x120, 0x130, 0x140, 0x160, 0x170, 0x190, 0x1A0, 0x1C0, 0x1D0,
    0x1F0, 0x200, 0x220, 0x230, 0x250, 0x260, 0x280, 0x290, 0x2B0, 0x2C0,
    0x2D0, 0x2E0, 0x2F0, 0x300, 0x310, 0x320, 0x340, 0x350, 0x360, 0x370
};

static mm_u32 sram_rule(mm_u32 part, mm_u32 sub)
{
    mm_u32 reg = mm_imxrt700_reg(ahbsc0, sram_rule_off[part] + (sub / 8u) * 4u);
    return (reg >> ((sub % 8u) * 4u)) & 3u;
}

mm_bool mm_imxrt700_mpcbb_block_secure(int bank, mm_u32 block_index)
{
    mm_u32 misc;
    mm_u32 start = block_index * IMXRT700_MPCBB_BLOCK_SIZE;
    mm_u32 end = start + IMXRT700_MPCBB_BLOCK_SIZE;
    mm_u32 base = 0;
    mm_u32 p;

    if (bank != 0 || ahbsc0 == 0 || active_core != 0u) {
        return MM_FALSE; /* only CPU0 (compute domain) rules are modelled */
    }
    misc = mm_imxrt700_reg(ahbsc0, AHBSC_MISC_CTRL);
    if (MISC_FIELD(misc, MISC_ENABLE_SECURE_CHECKING) != FIELD_ENABLED ||
        MISC_FIELD(misc, MISC_IDAU_ALL_NS) == FIELD_ENABLED) {
        return MM_FALSE;
    }
    for (p = 0; p < 30u; ++p) {
        mm_u32 size = (mm_u32)sram_part_kb[p] * 1024u;
        mm_u32 sub_size = size / 32u;
        if (start < base + size && end > base) {
            mm_u32 lo = (start > base ? start : base) - base;
            mm_u32 hi = (end < base + size ? end : base + size) - base;
            mm_u32 sub;
            for (sub = lo / sub_size; sub * sub_size < hi && sub < 32u; ++sub) {
                if (sram_rule(p, sub) >= 2u) {
                    return MM_TRUE;
                }
            }
        }
        base += size;
    }
    return MM_FALSE;
}

void mm_imxrt700_secure_set_active_core(mm_u32 core)
{
    active_core = core;
}

/* ------------------------------------------------------------------------ */
/* TRNG                                                                     */
/* ------------------------------------------------------------------------ */

#define TRNG_MCTL 0x00u
#define TRNG_ENT0 0x40u
#define TRNG_ENT_COUNT 16u
#define MCTL_RST_DEF (1u << 6)
#define MCTL_ENT_VAL (1u << 10)
#define MCTL_ERR (1u << 12)
#define MCTL_TSTOP_OK (1u << 13)
#define MCTL_PRGM (1u << 16)

static mm_u32 trng_ent[TRNG_ENT_COUNT];

static void trng_refill(void)
{
    mm_u32 i;
    for (i = 0; i < TRNG_ENT_COUNT; ++i) {
        trng_ent[i] = mm_host_rng_u32();
    }
}

static mm_bool trng_read(struct imxrt700_dev *dev, mm_u32 off, mm_u32 size, mm_u32 *value_out)
{
    if (size != 4u) {
        return MM_FALSE;
    }
    if (off == TRNG_MCTL) {
        mm_u32 v = mm_imxrt700_reg(dev, TRNG_MCTL) & ~(MCTL_ENT_VAL | MCTL_TSTOP_OK | MCTL_ERR | MCTL_RST_DEF);
        v |= (v & MCTL_PRGM) ? MCTL_TSTOP_OK : MCTL_ENT_VAL;
        *value_out = v;
        return MM_TRUE;
    }
    if (off >= TRNG_ENT0 && off < TRNG_ENT0 + 4u * TRNG_ENT_COUNT) {
        mm_u32 idx = (off - TRNG_ENT0) / 4u;
        if (mm_imxrt700_reg(dev, TRNG_MCTL) & MCTL_PRGM) {
            *value_out = 0u;
            return MM_TRUE;
        }
        *value_out = trng_ent[idx];
        if (idx == TRNG_ENT_COUNT - 1u && !mmio_peek_mode()) {
            trng_refill(); /* reading the last word starts a new generation */
        }
        return MM_TRUE;
    }
    return MM_FALSE;
}

static mm_bool trng_write(struct imxrt700_dev *dev, mm_u32 off, mm_u32 size, mm_u32 value)
{
    if (off == TRNG_MCTL && size == 4u) {
        mm_imxrt700_reg_put(dev, TRNG_MCTL, value & ~(MCTL_ERR | MCTL_RST_DEF | MCTL_ENT_VAL | MCTL_TSTOP_OK));
        return MM_TRUE;
    }
    if (off >= TRNG_ENT0 && off < TRNG_ENT0 + 4u * TRNG_ENT_COUNT) {
        return MM_TRUE;
    }
    return MM_FALSE;
}

/* ------------------------------------------------------------------------ */
/* OCOTP                                                                    */
/* ------------------------------------------------------------------------ */

#define OCOTP_FUSE_WORDS 512u
#define OCOTP_SHADOW_END 0x800u
#define OCOTP_CTRL 0x800u
#define OCOTP_CTRL_SET 0x804u
#define OCOTP_WRITE_DATA 0x808u
#define OCOTP_READ_CTRL 0x80Cu
#define OCOTP_READ_DATA 0x810u
#define OCOTP_CTRL_ADDR_MASK 0x1FFu
#define OCOTP_CTRL_RELOAD_SHADOWS (1u << 11)
#define OCOTP_WR_UNLOCK_KEY 0x3E77u

/* Fuses keep their value across emulated resets within one run. */
static mm_u32 fuses[OCOTP_FUSE_WORDS];
static mm_bool fuses_init;

static void fuses_seed(void)
{
    if (fuses_init) {
        return;
    }
    memset(fuses, 0, sizeof(fuses));
    /* Unique ID words, stable across runs. */
    fuses[0x10] = 0x52543730u; /* "RT70" */
    fuses[0x11] = 0x00000798u;
    fuses_init = MM_TRUE;
}

static mm_bool ocotp_read(struct imxrt700_dev *dev, mm_u32 off, mm_u32 size, mm_u32 *value_out)
{
    (void)dev;
    if (size != 4u) {
        return MM_FALSE;
    }
    if (off < OCOTP_SHADOW_END) {
        *value_out = fuses[off / 4u];
        return MM_TRUE;
    }
    return MM_FALSE;
}

static mm_bool ocotp_write(struct imxrt700_dev *dev, mm_u32 off, mm_u32 size, mm_u32 value)
{
    mm_u32 ctrl;
    if (size != 4u) {
        return MM_FALSE;
    }
    if (off < OCOTP_SHADOW_END) {
        return MM_TRUE; /* shadows are loaded from the fuses */
    }
    switch (off) {
    case OCOTP_READ_CTRL:
        if (value & 1u) {
            ctrl = mm_imxrt700_reg(dev, OCOTP_CTRL);
            mm_imxrt700_reg_put(dev, OCOTP_READ_DATA, fuses[ctrl & OCOTP_CTRL_ADDR_MASK]);
        }
        mm_imxrt700_reg_put(dev, OCOTP_READ_CTRL, value & ~1u);
        return MM_TRUE;
    case OCOTP_WRITE_DATA:
        ctrl = mm_imxrt700_reg(dev, OCOTP_CTRL);
        if ((ctrl >> 16) == OCOTP_WR_UNLOCK_KEY) {
            fuses[ctrl & OCOTP_CTRL_ADDR_MASK] |= value; /* fuses only blow 0 -> 1 */
        }
        mm_imxrt700_reg_put(dev, OCOTP_CTRL, ctrl & 0xFFFFu);
        return MM_TRUE;
    case OCOTP_CTRL:
    case OCOTP_CTRL_SET:
        if (!mm_imxrt700_regfile_write(dev, off, size, value)) {
            return MM_FALSE;
        }
        /* RELOAD_SHADOWS completes immediately. */
        mm_imxrt700_reg_put(dev, OCOTP_CTRL, mm_imxrt700_reg(dev, OCOTP_CTRL) & ~OCOTP_CTRL_RELOAD_SHADOWS);
        return MM_TRUE;
    default:
        return MM_FALSE;
    }
}

mm_bool mm_imxrt700_otp_read(mm_u32 index, mm_u32 *value_out)
{
    if (index >= OCOTP_FUSE_WORDS || value_out == 0) {
        return MM_FALSE;
    }
    *value_out = fuses[index];
    return MM_TRUE;
}

mm_bool mm_imxrt700_otp_program(mm_u32 index, mm_u32 value)
{
    if (index >= OCOTP_FUSE_WORDS) {
        return MM_FALSE;
    }
    fuses[index] |= value;
    return MM_TRUE;
}

/* ------------------------------------------------------------------------ */
/* ELS / PKC / PUF synthetic command interface                              */
/* ------------------------------------------------------------------------ */

