danielinux/m33mu/cpu/imxrt700/imxrt700_secure.c
#define SEC_CMD 0x000u
#define SEC_STATUS 0x004u
#define SEC_ARG0 0x008u
#define SEC_RESULT0 0x020u
#define SEC_KEYIN0 0x080u
#define SEC_DATA0 0x100u

#define ST_BUSY (1u << 0)
#define ST_DONE (1u << 1)
#define ST_ERROR (1u << 2)
#define ST_SECURE (1u << 3)

#define ELS_SLOTS 8u
#define SEC_MAX_BUF 0x10000u

enum sec_block { BLK_ELS = 0, BLK_PKC = 1, BLK_PUF = 2 };

struct sec_regs {
    enum sec_block blk;
    mm_u32 cmd;
    mm_u32 status;
    mm_u32 arg[4];
    mm_u32 result[4];
    mm_u32 keyin[4];
    mm_u32 data[4];
};

struct sec_slot {
    mm_bool valid;
    mm_u8 key[32];
};

static struct sec_regs sec[3];
static struct sec_slot slots[ELS_SLOTS];
static mm_u8 device_key[32];
static mm_u8 puf_secret[32];
static mm_bool puf_enrolled;

static mm_bool mem_get(mm_u32 addr, mm_u8 *buf, mm_u32 len)
{
    struct mm_memmap *map = mm_imxrt700_memmap();
    mm_u32 i;
    if (map == 0 || len > SEC_MAX_BUF) {
        return MM_FALSE;
    }
    for (i = 0; i < len; ++i) {
        if (!mm_memmap_read8(map, MM_SECURE, addr + i, &buf[i])) {
            return MM_FALSE;
        }
    }
    return MM_TRUE;
}

static mm_bool mem_put(mm_u32 addr, const mm_u8 *buf, mm_u32 len)
{
    struct mm_memmap *map = mm_imxrt700_memmap();
    mm_u32 i;
    if (map == 0 || len > SEC_MAX_BUF) {
        return MM_FALSE;
    }
    for (i = 0; i < len; ++i) {
        if (!mm_memmap_write(map, MM_SECURE, addr + i, 1u, buf[i])) {
            return MM_FALSE;
        }
    }
    return MM_TRUE;
}

static void rng_fill(mm_u8 *out, mm_u32 len)
{
    mm_u32 i;
    for (i = 0; i < len; i += 4u) {
        mm_u32 w = mm_host_rng_u32();
        mm_u32 n = (len - i < 4u) ? len - i : 4u;
        memcpy(out + i, &w, n);
    }
}

static void regs_put32(struct sec_regs *r, const mm_u8 v[32])
{
    mm_u32 i;
    for (i = 0; i < 4u; ++i) {
        r->result[i] = rd32le(v + 4u * i);
        r->data[i] = rd32le(v + 16u + 4u * i);
    }
}

static void keyin_bytes(const struct sec_regs *r, mm_u8 out[16])
{
    mm_u32 i;
    for (i = 0; i < 4u; ++i) {
        wr32le(out + 4u * i, r->keyin[i]);
    }
}

#ifdef M33MU_HAS_WOLFSSL
static mm_bool hmac256(const mm_u8 *key, mm_u32 key_len, const mm_u8 *in, mm_u32 in_len, mm_u8 out[32])
{
    Hmac h;
    int rc;
    if (wc_HmacInit(&h, NULL, INVALID_DEVID) != 0) {
        return MM_FALSE;
    }
    rc = wc_HmacSetKey(&h, WC_SHA256, key, key_len);
    if (rc == 0) rc = wc_HmacUpdate(&h, in, in_len);
    if (rc == 0) rc = wc_HmacFinal(&h, out);
    wc_HmacFree(&h);
    return rc == 0 ? MM_TRUE : MM_FALSE;
}

static mm_bool sha256(const mm_u8 *in, mm_u32 len, mm_u8 out[32])
{
    wc_Sha256 s;
    int rc = wc_InitSha256(&s);
    if (rc == 0) rc = wc_Sha256Update(&s, in, len);
    if (rc == 0) rc = wc_Sha256Final(&s, out);
    wc_Sha256Free(&s);
    return rc == 0 ? MM_TRUE : MM_FALSE;
}

static mm_bool aes_cbc(int enc, const mm_u8 key[32], const mm_u8 iv[16], mm_u8 *buf, mm_u32 len)
{
    Aes aes;
    int rc;
    if (wc_AesInit(&aes, NULL, INVALID_DEVID) != 0) {
        return MM_FALSE;
    }
    rc = wc_AesSetKey(&aes, key, 32, iv, enc ? AES_ENCRYPTION : AES_DECRYPTION);
    if (rc == 0) {
        rc = enc ? wc_AesCbcEncrypt(&aes, buf, buf, len) : wc_AesCbcDecrypt(&aes, buf, buf, len);
    }
    wc_AesFree(&aes);
    return rc == 0 ? MM_TRUE : MM_FALSE;
}

static mm_bool modop(mm_u32 op, const mm_u8 *a, const mm_u8 *b, const mm_u8 *m, mm_u32 len, mm_u8 *out)
{
    mp_int A, B, M, Z;
    int rc = -1;
    int n;
    if (mp_init_multi(&A, &B, &M, &Z, NULL, NULL) != 0) {
        return MM_FALSE;
    }
    if (mp_read_unsigned_bin(&A, a, (int)len) == 0 &&
        mp_read_unsigned_bin(&B, b, (int)len) == 0 &&
        mp_read_unsigned_bin(&M, m, (int)len) == 0) {
        rc = (op == 1u) ? mp_exptmod(&A, &B, &M, &Z) : mp_mulmod(&A, &B, &M, &Z);
    }
    if (rc == 0) {
        n = mp_unsigned_bin_size(&Z);
        if (n < 0 || (mm_u32)n > len) {
            rc = -1;
        } else {
            memset(out, 0, len);
            rc = mp_to_unsigned_bin(&Z, out + (len - (mm_u32)n));
        }
    }
    mp_clear(&A);
    mp_clear(&B);
    mp_clear(&M);
    mp_clear(&Z);
    return rc == 0 ? MM_TRUE : MM_FALSE;
}
#endif /* M33MU_HAS_WOLFSSL */

static mm_bool slot_ok(mm_u32 slot)
{
    return slot < ELS_SLOTS ? MM_TRUE : MM_FALSE;
}

#ifdef M33MU_HAS_WOLFSSL
static mm_bool els_mac(const struct sec_regs *r, mm_u8 mac[32])
{
    static mm_u8 buf[SEC_MAX_BUF];
    mm_u32 slot = r->arg[0];
    if (!slot_ok(slot) || !slots[slot].valid || !mem_get(r->arg[1], buf, r->arg[2])) {
        return MM_FALSE;
    }
    return hmac256(slots[slot].key, 32u, buf, r->arg[2], mac);
}

static mm_bool els_exec(struct sec_regs *r)
{
    static mm_u8 buf[SEC_MAX_BUF];
    mm_u8 v[32];
    mm_u8 ctx[16];
    mm_u32 slot = r->arg[0];

    switch (r->cmd) {
    case 1u: /* GENERATE */
        if (!slot_ok(slot)) return MM_FALSE;
        rng_fill(slots[slot].key, 32u);
        slots[slot].valid = MM_TRUE;
        return MM_TRUE;
    case 2u: /* DERIVE */
        if (!slot_ok(slot)) return MM_FALSE;
        keyin_bytes(r, ctx);
        if (!hmac256(device_key, 32u, ctx, 16u, slots[slot].key)) return MM_FALSE;
        slots[slot].valid = MM_TRUE;
        return MM_TRUE;
    case 3u: /* IMPORT */
        if (!slot_ok(slot)) return MM_FALSE;
        keyin_bytes(r, slots[slot].key);
        wr32le(slots[slot].key + 16u, r->data[0]);
        wr32le(slots[slot].key + 20u, r->data[1]);
        wr32le(slots[slot].key + 24u, r->data[2]);
        wr32le(slots[slot].key + 28u, r->data[3]);
        slots[slot].valid = MM_TRUE;
        return MM_TRUE;
    case 4u: /* SIGN */
        if (!els_mac(r, v)) return MM_FALSE;
        regs_put32(r, v);
        return MM_TRUE;
    case 5u: { /* VERIFY */
        mm_u8 expect[32];
        if (!els_mac(r, v) || !mem_get(r->arg[3], expect, 32u)) return MM_FALSE;
        r->result[0] = (memcmp(v, expect, 32u) == 0) ? 1u : 0u;
        return r->result[0] ? MM_TRUE : MM_FALSE;
    }
    case 8u: /* SHA256 */
        if (!mem_get(r->arg[1], buf, r->arg[2]) || !sha256(buf, r->arg[2], v)) return MM_FALSE;
        regs_put32(r, v);
        if (r->arg[3] != 0u && !mem_put(r->arg[3], v, 32u)) return MM_FALSE;
        return MM_TRUE;
    case 9u:  /* AES_ENC */
    case 10u: /* AES_DEC */
        if (!slot_ok(slot) || !slots[slot].valid || (r->arg[2] & 15u) != 0u) return MM_FALSE;
        keyin_bytes(r, ctx);
        if (!mem_get(r->arg[1], buf, r->arg[2])) return MM_FALSE;
        if (!aes_cbc(r->cmd == 9u, slots[slot].key, ctx, buf, r->arg[2])) return MM_FALSE;
        return mem_put(r->arg[3], buf, r->arg[2]);
    default:
        return MM_FALSE;
    }
}

static mm_bool pkc_exec(struct sec_regs *r)
{
    static mm_u8 a[512], b[512], m[512], z[512];
    mm_u32 len = r->arg[3];
    if (len == 0u || len > sizeof(a) || (r->cmd != 1u && r->cmd != 2u)) {
        return MM_FALSE;
    }
    if (!mem_get(r->arg[0], a, len) || !mem_get(r->arg[1], b, len) || !mem_get(r->arg[2], m, len)) {
        return MM_FALSE;
    }
    if (!modop(r->cmd, a, b, m, len, z)) {
        return MM_FALSE;
    }
    return mem_put(r->data[0], z, len);
}

static mm_bool puf_exec(struct sec_regs *r)
{
    mm_u8 ctx[16];
    mm_u8 fp[32];
    mm_u32 slot = r->arg[0];
    if (r->cmd == 1u) {
        puf_enrolled = MM_TRUE;
        r->result[0] = 1u;
        return MM_TRUE;
    }
    if (r->cmd != 2u || !puf_enrolled || !slot_ok(slot)) {
        return MM_FALSE;
    }
    keyin_bytes(r, ctx);
    if (!hmac256(puf_secret, 32u, ctx, 16u, slots[slot].key) || !sha256(slots[slot].key, 32u, fp)) {
        return MM_FALSE;
    }
    slots[slot].valid = MM_TRUE;
    r->result[0] = 0xCAFE0000u | slot;
    r->result[1] = rd32le(fp);
    return MM_TRUE;
}
#endif /* M33MU_HAS_WOLFSSL */

static void sec_exec(struct sec_regs *r)
{
    enum sec_block blk = r->blk;
    mm_bool ok = MM_FALSE;
    if (blk == BLK_ELS && r->cmd == 7u) { /* RNG needs no crypto library */
        mm_u8 v[32];
        rng_fill(v, sizeof(v));
        regs_put32(r, v);
        ok = MM_TRUE;
        if (r->arg[1] != 0u) {
            static mm_u8 buf[SEC_MAX_BUF];
            ok = (r->arg[2] <= SEC_MAX_BUF) ? MM_TRUE : MM_FALSE;
            if (ok) {
                rng_fill(buf, r->arg[2]);
                ok = mem_put(r->arg[1], buf, r->arg[2]);
            }
        }
    } else {
#ifdef M33MU_HAS_WOLFSSL
        switch (blk) {
        case BLK_ELS: ok = els_exec(r); break;
        case BLK_PKC: ok = pkc_exec(r); break;
        case BLK_PUF: ok = puf_exec(r); break;
        default: break;
        }
#else
        ok = MM_FALSE; /* crypto engines need wolfSSL */
#endif
    }
    r->status &= ~(ST_BUSY | ST_DONE | ST_ERROR);
    r->status |= ok ? ST_DONE : ST_ERROR;
}

static mm_u32 *sec_word(struct sec_regs *r, mm_u32 off)
{
    if (off == SEC_CMD) return &r->cmd;
    if (off == SEC_STATUS) return &r->status;
    if (off >= SEC_ARG0 && off < SEC_ARG0 + 16u) return &r->arg[(off - SEC_ARG0) / 4u];
    if (off >= SEC_RESULT0 && off < SEC_RESULT0 + 16u) return &r->result[(off - SEC_RESULT0) / 4u];
    if (off >= SEC_KEYIN0 && off < SEC_KEYIN0 + 16u) return &r->keyin[(off - SEC_KEYIN0) / 4u];
    if (off >= SEC_DATA0 && off < SEC_DATA0 + 16u) return &r->data[(off - SEC_DATA0) / 4u];
    return 0;
}

