danielinux/m33mu/cpu/imxrt700/imxrt700_secure.c
static mm_bool sec_read(struct imxrt700_dev *dev, mm_u32 off, mm_u32 size, mm_u32 *value_out)
{
    struct sec_regs *r = (struct sec_regs *)dev->opaque;
    mm_u32 *w;
    if (mmio_active_sec() != MM_SECURE) {
        *value_out = 0u; /* secure-only block: RAZ from the non-secure world */
        return MM_TRUE;
    }
    w = sec_word(r, off & ~3u);
    if (w == 0 || size != 4u) {
        return MM_FALSE;
    }
    *value_out = *w;
    return MM_TRUE;
}

static mm_bool sec_write(struct imxrt700_dev *dev, mm_u32 off, mm_u32 size, mm_u32 value)
{
    struct sec_regs *r = (struct sec_regs *)dev->opaque;
    mm_u32 *w;
    if (mmio_active_sec() != MM_SECURE) {
        return MM_TRUE; /* WI */
    }
    w = sec_word(r, off);
    if (w == 0 || size != 4u) {
        return MM_FALSE;
    }
    if (off == SEC_STATUS) {
        r->status &= ~(value & (ST_DONE | ST_ERROR));
        return MM_TRUE;
    }
    *w = value;
    if (off == SEC_CMD) {
        r->status |= ST_BUSY;
        sec_exec(r);
    }
    return MM_TRUE;
}

static void sec_identity_init(void)
{
    static const char default_uds[] = "m33mu-imxrt700-device-secret";
    const char *hex = getenv("M33MU_IMXRT700_UDS_HEX");
    mm_u32 i;
    memset(device_key, 0, sizeof(device_key));
    if (hex != 0 && strlen(hex) == 64u) {
        for (i = 0; i < 32u; ++i) {
            char byte[3];
            byte[0] = hex[2u * i];
            byte[1] = hex[2u * i + 1u];
            byte[2] = 0;
            device_key[i] = (mm_u8)strtoul(byte, 0, 16);
        }
    } else {
        memcpy(device_key, default_uds, sizeof(default_uds) - 1u);
    }
    for (i = 0; i < 32u; ++i) {
        puf_secret[i] = (mm_u8)(device_key[i] ^ 0x5Cu ^ (mm_u8)(i * 37u));
    }
}

/* ------------------------------------------------------------------------ */

void mm_imxrt700_secure_attach(void)
{
    static const char *const ahbsc_names[] = { "AHBSC0", "AHBSC3", "AHBSC4" };
    mm_u32 i;
    char name[8];

    for (i = 0; i < GLIKEY_COUNT; ++i) {
        snprintf(name, sizeof(name), "GLIKEY%lu", (unsigned long)i);
        glikeys[i].dev = mm_imxrt700_dev(name);
        (void)mm_imxrt700_dev_hook(name, glikey_read, glikey_write, &glikeys[i]);
    }
    ahbsc0 = mm_imxrt700_dev("AHBSC0");
    for (i = 0; i < 3u; ++i) {
        (void)mm_imxrt700_dev_hook(ahbsc_names[i], 0, ahbsc_write, 0);
    }
    (void)mm_imxrt700_dev_hook("TRNG", trng_read, trng_write, 0);
    (void)mm_imxrt700_dev_hook("OCOTP", ocotp_read, ocotp_write, 0);
    (void)mm_imxrt700_dev_hook("ELS", sec_read, sec_write, &sec[BLK_ELS]);
    (void)mm_imxrt700_dev_hook("PKC", sec_read, sec_write, &sec[BLK_PKC]);
    (void)mm_imxrt700_dev_hook("PUF_CTRL", sec_read, sec_write, &sec[BLK_PUF]);
}

void mm_imxrt700_secure_reset(void)
{
    mm_u32 i;
    for (i = 0; i < GLIKEY_COUNT; ++i) {
        glikey_reset_one(&glikeys[i]);
        memset(glikeys[i].index_locked, 0, sizeof(glikeys[i].index_locked));
    }
    active_core = 0u;
    trng_refill();
    fuses_seed();
    memset(sec, 0, sizeof(sec));
    for (i = 0; i < 3u; ++i) {
        sec[i].blk = (enum sec_block)i;
        sec[i].status = ST_SECURE | ST_DONE;
    }
    memset(slots, 0, sizeof(slots));
    puf_enrolled = MM_FALSE;
    sec_identity_init();
}

void mm_imxrt700_secure_flash_bind(mm_u8 *flash, mm_u32 flash_size)
{
    (void)flash;
    (void)flash_size;
}
